Chouxmimouli/STM32-QuickShifter/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define KillSwitch_Pin GPIO_PIN_12
#define KillSwitch_GPIO_Port GPIOB
#define InGear4_Pin GPIO_PIN_13
#define InGear4_GPIO_Port GPIOB
#define InGear3_Pin GPIO_PIN_14
#define InGear3_GPIO_Port GPIOB
#define InGear2_Pin GPIO_PIN_15
#define InGear2_GPIO_Port GPIOB
#define InGear1_Pin GPIO_PIN_8
#define InGear1_GPIO_Port GPIOA
#define InGear0_Pin GPIO_PIN_9
#define InGear0_GPIO_Port GPIOA
#define OutGear4_Pin GPIO_PIN_11
#define OutGear4_GPIO_Port GPIOA
#define OutGear3_Pin GPIO_PIN_15
#define OutGear3_GPIO_Port GPIOA
#define OutGear2_Pin GPIO_PIN_4
#define OutGear2_GPIO_Port GPIOB
#define OutGear1_Pin GPIO_PIN_6
#define OutGear1_GPIO_Port GPIOB
#define OutGear0_Pin GPIO_PIN_8
#define OutGear0_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
